/********************************************************************************
* タイトル　RESULT
* ファイル名　CResult.cpp
* 作成者 AT13B284 42 李昊盛
* 作成日 2016/07/11
TITLEのモード処理
********************************************************************************/
#include "main.h"
#include "manager.h"
#include "renderer.h"
#include "scene2D.h"
#include "sceneInput.h"
#include "CResult.h"
#include "CResultbg.h"
//------------------------------------------------------------------------------
//	関数名:	CResult::CResult
//	引数:	なし
//	戻り値:	なし
//	説明:	コンストラクタ
//------------------------------------------------------------------------------
CResult::CResult()
{

}

//------------------------------------------------------------------------------
//	関数名:	CResult::~CResult
//	引数:	なし
//	戻り値:	CResult
//	説明:	コンストラクタ
//------------------------------------------------------------------------------
CResult::~CResult()
{
}

//------------------------------------------------------------------------------
//	関数名:	void CResult::Init
//	引数:	なし
//	戻り値:	なし
//	説明:	初期化処理
//------------------------------------------------------------------------------
void CResult::Init(void)
{
	CResultbg::Create(D3DXVECTOR3(SCREEN_CENTER_X,SCREEN_CENTER_Y,0.0f),D3DXVECTOR3(0.0f,0.0f,0.0f),SCREEN_HEIGHT,SCREEN_WIDTH,TEXTURE_RESULTBG_FILE);
}

//------------------------------------------------------------------------------
//	関数名:	void CResult::Uninit
//	引数:	なし
//	戻り値:	なし
//	説明:	終了処理
//------------------------------------------------------------------------------
void CResult::Uninit(void)
{
	CScene::UninitAll();
}

//------------------------------------------------------------------------------
//	関数名:	void CResult::Update
//	引数:	なし
//	戻り値:	なし
//	説明:	更新処理
//------------------------------------------------------------------------------
void CResult::Update(void)
{
	CManager *manager = GetManager();
	CSceneInput *m_Input = manager -> GetInput();
	CScene::UpdateAll();
	if(m_Input->GetKeyboardTrigger(DIK_RETURN))
	{
		CManager::SetMode( CManager::MODE_TITLE );
	}
}

//------------------------------------------------------------------------------
//	関数名:	void CResult::Draw
//	引数:	なし
//	戻り値:	なし
//	説明:	描画処理
//------------------------------------------------------------------------------
void CResult::Draw(void)
{

	CScene::DrawAll();

}
